Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/migrant_workers/coming_from_eu_to_work.html.txt.tmx
Source language: en
Languages: ga

source: Coming from the EU/EEA to work
ga: Ag teacht ón AE/LEE chun oibriú

source: As an EU national you are entitled to come to Ireland to take up employment or self-employment
ga: Mar shaoránach de chuid an Limistéir Eorpaigh Eacnamaíoch (LEE) tá tú i dteideal teacht go hÉirinn chun gabháil d’fhostaíocht nó d’fhéinfhostaíocht

source: You do not need an employment permit
ga: Ní gá duit cead fostaíochta a fháil

source: Nationals from the other countries of the European Economic Area (EEA), that is, Norway, Iceland and Liechtenstein, and Switzerland do not need employment permits to work in Ireland
ga: Ní gá do shaoránaigh as na tíortha eile de chuid an LEE (an Iorua, an Íoslann agus Lichtinstéin) agus de chuid na hEilvéise ceadanna fostaíochta a fháil chun dul i mbun oibre in Éirinn

source: If you are an EEA or Swiss national you and your family members have the right to come to Ireland for 3 months with no conditions attached under the European Communities (Free Movement of Persons) Regulations 2015 which implement an EU Directive on the free movement of persons
ga: Más náisiúnach de chuid an AE/LEE nó de chuid na hEilvéise tú tá an ceart agat agus ag na daoine de do theaghlach teacht go hÉirinn ar feadh 3 mhí gan aon choinníollacha a bheith ag gabháil leis mar go ndearnadh dlí de Rialacháin 2015 (Saorghluaiseacht Daoine) na gComhphobal Eorpach, lena gcuirtear Treoir de chuid an AE maidir le saorghluaiseacht daoine i ngníomh

source: You then have the right of residence for longer than 3 months if:
ga: Tá ceart cónaithe agat ansin go ceann tréimhse is faide ná 3 mhí más rud é:

source: • You are employed or self-employed
ga: • Go bhfuil tú ag obair nó go bhfuil tú féinfhostaithe

source: • You have enough resources so that you and your dependants do not become a burden on the social assistance system and you have comprehensive sickness insurance
ga: • Go bhfuil go leor acmhainní agat ionas nach dtiocfaidh tú agus do chleithiúnaithe chun bheith ina n-ualach ar an gcóras um chúnamh sóisialach agus go bhfuil árachas cuimsitheach breoiteachta agat

source: • You are a student, you can maintain yourself, you have a place in an educational institution and you have sickness insurance
ga: • Gur mac léinn tú, gur féidir leat tú féin a chothú, go bhfuil áit agat in institiúid oideachais agus go bhfuil árachas breoiteachta agat

source: EEA and Swiss nationals are not required to register with the immigration authorities
ga: Ní cheanglaítear ar náisiúnaigh de chuid an AE/LEE nó de chuid na hEilvéise clárú leis na húdaráis inimirce

source: Family members of EU citizens who are not themselves EEA or Swiss nationals are required to register with the immigration authorities and apply for a residence card under EU Treaty Rights
ga: Ceanglaítear ar dhaoine de theaghlaigh saoránach de chuid an AE nach náisiúnaigh iad féin de chuid an AE/LEE nó de chuid na hEilvéise a chlárú leis na húdaráis um inimirce agus cárta cónaithe de réir cearta Chonradh AE a fháil

source: You can read more in our document on the residence rights of EEA nationals
ga: Tá tuilleadh faisnéise faoi chearta cónaithe náisiúnach de chuid an AE/LEE ar fáil

source: If you are an Irish citizen who has worked in another EEA country and are returning to Ireland, you are officially a migrant worker under EU legislation
ga: Más saoránach Éireannach thú ag filleadh ar an tír seo agus má bhí tú ag obair i dtír eile den AE is oibrí inimirce thú go hoifigiúil de réir dlí an AE

source: This means that, among other things, your social security rights are extensively affected by EU Regulations
ga: Dá bharr seo, i measc rudaí eile, tá tionchar an-mhór ag Rialacha an AE ar na cearta leasa shóisialaigh atá agat

source: If you are unemployed, your unemployment benefit in the country you are leaving may be transferred after you have been receiving it for 4 weeks
ga: Má tá tú dífhostaithe, ba cheart duit iarratas ar shochar dífhostaíochta a dhéanamh sa tír atá á agat fágáil agus ansin é a fháil aistrithe go hÉirinn

source: Under EU Regulations you can ask for it to be transferred to Ireland and you should bring a copy of the form U2 (which is replacing form E303) with details of your payment
ga: Faoi Rialacháin AE is féidir an sochar a aistriú agus ba chóir duit an fhoirm U2 (E303 roimhe seo) le sonraí do chuid íocaíocht a thabhairt

source: You must, of course, comply with the rules for getting benefit in the country that you are leaving
ga: Beidh ort na rialacha atá i bhfeidhm sa tír sin i dtaobh sochar dífhostaíochta a shásamh

source: When you arrive in Ireland, you should sign on at your local social welfare office - see 'Where to apply' below within a week
ga: Nuair a thagann tú go hÉirinn ba cheart duit síniú ag an oifig áitiúil leasa shóisialaigh - féach 'Cá háit a dhéanfaidh mé iarratas' thíos

source: You may then receive your benefit for 13 weeks (up to 26 weeks in some cases)
ga: Cuirfear sochar ar fáil ansin duit ar feadh 13 seachtain (suas go 26 seachtain i gcasanna áirithe)

source: You get the same benefit as you would get if you stayed in the country you have left
ga: Gheobhaidh tú an sochar céanna agus a bhí ar fáil duit sa tír ina raibh tú

source: You are entitled to medical card services in Ireland while you are receiving unemployment benefit from the other country
ga: Tá sé de cheart agat seirbhísí cárta leighis in Éirinn a bheith agat an fhad agus atá sochar díofhostaíochta dhá fháil agat ó thír eile

source: After 13 weeks have expired, you will be in the normal Irish social welfare system
ga: Tar éis 13 seachtain titfidh tú faoin ngnáthchóras leasa shóisialaigh in Éirinn

source: In order to qualify for benefits in Ireland, you need to get a job and pay at least one Class A PRSI contribution
ga: Beidh ort post a fháil in Éirinn agus ranníocaíocht amháin ar a laghad ag Aicme A den chóras ÁSPC a íoc le bheith i dteideal sochair

source: At this point, your contributions from the other country you worked in may be added to your Irish contribution(s) to help you qualify for benefits
ga: Ag an bpointe sin cuirfear na ranníocaíochtaí ón tír eile le chéile leis an ranníocaíocht Éireannach ar mhaithe le sochair a chur ar fáil duit

source: When you are coming to Ireland you should bring a record of your contributions on Forms U1 (formerly E301) and E104 from the social security institution in the country you are leaving
ga: Nuair atá tú ag filleadh ar Éirinn ba cheart duit fianaise ar na híocaíochtaí atá déanta agat a thabhairt leat ar Foirmeacha U1 (E301 roimhe seo) agus E104 ón institiúid leasa shóisialaigh sa tír ina bhfuil tú ag fágáil

source: These forms will help speed up the payment of benefits under EU Regulations
ga: Beidh an próiséas le sochair a íoc faoi rialacha an AE i bhfad níos tapúla má tá na foirmeacha sin agat

source: If you are employed when you come to Ireland then you are covered by the normal Irish rules relating to social welfare
ga: Más fostaí thú nuair a thagann tú ar ais go hÉirinn beidh tú clúdaithe faoi na gnáthrialacha leasa shóisialaigh in Éirinn

source: Under EU Regulations, EEA and Swiss citizens and non-EEA nationals who have previously worked in another EEA state, are exempt from the habitual residence condition for family benefits provided they are employed or self-employed in Ireland and subject to the Irish social welfare system
ga: Faoi Rialacháin AE, má tá saoránaigh de chuid LEE nó na hEilvéise agus náisiúnaigh neamh-LEE a d’oibrigh i stát LEE eile roimhe sin, fostaithe nó féinfhostaithe in Éirinn agus má tá siad páirteach i gcóras Árachas Sóisialta na hÉireann, tá siad díolmhaithe ón gcoinníoll maidir le gnáthchónaí chun sochair theaghlaigh a fháil

source: EEA workers will satisfy the habitual residence condition for Supplementary Welfare Allowance but people from the EU/EEA who move to Ireland in search of employment are subject to the habitual residence test in the normal way while looking for work
ga: Is féidir oibrithe de chuid AE/ LEE nó na hEilvéise an coinníoll maidir le gnáthchónaí a shásamh chun Liúntas Leasa Forlíontach a fháil. Maidir le saoránaigh de chuid LEE nó na hEilvéise a thagann go hÉirinn ag cuardach fostaíochta, áfach, ní mór dóibh an Coinníoll maidir le Gnáthchónaí a shásamh fad is atá siad ag lorg oibre

source: Rights while working in Ireland
ga: Do chearta agus tú ag obair in Éirinn

source: As an EEA national working in Ireland, you are entitled to exactly the same rights as Irish citizens with regard to social welfare, employment rights and social rights in general
ga: Mar shaoránach den AE/CEE atá ag obair in Éirinn tá tú i dteideal na cearta ceanna agus atá saoránaigh Éireannacha faoin gcóras leasa shóisialaigh, mar aon le cearta fostaíochta agus sóisialta go ginearálta

source: As soon as you come to Ireland you should register for tax and social insurance by applying for a Personal Public Service (PPS) number
ga: Nuair a thagann tú go hÉirinn ba cheart duit iarratas a dhéanamh ar uimhir Phearsanta Seirbhíse Poiblí chun chlárú ar chursaí cánach agus árachas sóisialta

source: If you need help finding a job in Ireland you can get advice on employment and training opportunities from your local employment services office
ga: Má bíonn cabhair chun post a fháil ag teastáil uait, is féidir leat comhairle faoi dheiseanna fostaíochta agus oideachais ó d'oifig seirbhísí fostaiochta áitiúil a fháil

source: If you are posted here by your employer on a temporary basis, you are entitled to the equivalent of medical card services
ga: Má chuireann do fhostóir anseo thú go sealadach tá tú i dteideal na seirbhísí céanna agus atá daoine le cártaí leighis

source: If you are employed or self-employed and staying on a permanent basis, you come under the same rules for entitlement to health services as Irish nationals generally
ga: Má tá tú fostaithe nó féin-fhostaithe agus ag fanacht go buan, baineann na rialacha céanna leat maidir le cearta seirbhísí sláinte agus a bhaineann le saoránaigh Éireannacha go ginearálta

source: Therefore, you must pass a means test to get a medical card
ga: Mar sin, beidh ort scrúdú maoine a shásamh le cárta leighis a fháil

source: Contact your local social welfare office or Intreo centre
ga: Déan teaghmháil leis an oifig áitiúil leasa shóisialaigh nó ionad Intreo
